Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/include/pio/pic32ck1025sg01064.h
#define PIN_PB00C_SERCOM5_PAD2                     _UINT32_(32)
#define MUX_PB00C_SERCOM5_PAD2                     _UINT32_(2) 
#define PINMUX_PB00C_SERCOM5_PAD2                  ((PIN_PB00C_SERCOM5_PAD2 << 16) | MUX_PB00C_SERCOM5_PAD2)
#define PORT_PB00C_SERCOM5_PAD2                    (_UINT32_(1) << 0)

#define PIN_PA08D_SERCOM5_PAD3                     _UINT32_(8) 
#define MUX_PA08D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PA08D_SERCOM5_PAD3                  ((PIN_PA08D_SERCOM5_PAD3 << 16) | MUX_PA08D_SERCOM5_PAD3)
#define PORT_PA08D_SERCOM5_PAD3                    (_UINT32_(1) << 8)

#define PIN_PB01C_SERCOM5_PAD3                     _UINT32_(33)
#define MUX_PB01C_SERCOM5_PAD3                     _UINT32_(2) 
#define PINMUX_PB01C_SERCOM5_PAD3                  ((PIN_PB01C_SERCOM5_PAD3 << 16) | MUX_PB01C_SERCOM5_PAD3)
#define PORT_PB01C_SERCOM5_PAD3                    (_UINT32_(1) << 1)

/* ========== PORT definition for SERCOM6 peripheral ========== */
#define PIN_PA00D_SERCOM6_PAD0                     _UINT32_(0) 
#define MUX_PA00D_SERCOM6_PAD0                     _UINT32_(3) 
#define PINMUX_PA00D_SERCOM6_PAD0                  ((PIN_PA00D_SERCOM6_PAD0 << 16) | MUX_PA00D_SERCOM6_PAD0)
#define PORT_PA00D_SERCOM6_PAD0                    (_UINT32_(1) << 0)

#define PIN_PA07C_SERCOM6_PAD0                     _UINT32_(7) 
#define MUX_PA07C_SERCOM6_PAD0                     _UINT32_(2) 
#define PINMUX_PA07C_SERCOM6_PAD0                  ((PIN_PA07C_SERCOM6_PAD0 << 16) | MUX_PA07C_SERCOM6_PAD0)
#define PORT_PA07C_SERCOM6_PAD0                    (_UINT32_(1) << 7)

#define PIN_PA01D_SERCOM6_PAD1                     _UINT32_(1) 
#define MUX_PA01D_SERCOM6_PAD1                     _UINT32_(3) 
#define PINMUX_PA01D_SERCOM6_PAD1                  ((PIN_PA01D_SERCOM6_PAD1 << 16) | MUX_PA01D_SERCOM6_PAD1)
#define PORT_PA01D_SERCOM6_PAD1                    (_UINT32_(1) << 1)

#define PIN_PA08C_SERCOM6_PAD1                     _UINT32_(8) 
#define MUX_PA08C_SERCOM6_PAD1                     _UINT32_(2) 
#define PINMUX_PA08C_SERCOM6_PAD1                  ((PIN_PA08C_SERCOM6_PAD1 << 16) | MUX_PA08C_SERCOM6_PAD1)
#define PORT_PA08C_SERCOM6_PAD1                    (_UINT32_(1) << 8)

#define PIN_PA02D_SERCOM6_PAD2                     _UINT32_(2) 
#define MUX_PA02D_SERCOM6_PAD2                     _UINT32_(3) 
#define PINMUX_PA02D_SERCOM6_PAD2                  ((PIN_PA02D_SERCOM6_PAD2 << 16) | MUX_PA02D_SERCOM6_PAD2)
#define PORT_PA02D_SERCOM6_PAD2                    (_UINT32_(1) << 2)

#define PIN_PA09C_SERCOM6_PAD2                     _UINT32_(9) 
#define MUX_PA09C_SERCOM6_PAD2                     _UINT32_(2) 
#define PINMUX_PA09C_SERCOM6_PAD2                  ((PIN_PA09C_SERCOM6_PAD2 << 16) | MUX_PA09C_SERCOM6_PAD2)
#define PORT_PA09C_SERCOM6_PAD2                    (_UINT32_(1) << 9)

#define PIN_PA03D_SERCOM6_PAD3                     _UINT32_(3) 
#define MUX_PA03D_SERCOM6_PAD3                     _UINT32_(3) 
#define PINMUX_PA03D_SERCOM6_PAD3                  ((PIN_PA03D_SERCOM6_PAD3 << 16) | MUX_PA03D_SERCOM6_PAD3)
#define PORT_PA03D_SERCOM6_PAD3                    (_UINT32_(1) << 3)

#define PIN_PA09D_SERCOM6_PAD3                     _UINT32_(9) 
#define MUX_PA09D_SERCOM6_PAD3                     _UINT32_(3) 
#define PINMUX_PA09D_SERCOM6_PAD3                  ((PIN_PA09D_SERCOM6_PAD3 << 16) | MUX_PA09D_SERCOM6_PAD3)
#define PORT_PA09D_SERCOM6_PAD3                    (_UINT32_(1) << 9)

#define PIN_PA10C_SERCOM6_PAD3                     _UINT32_(10)
#define MUX_PA10C_SERCOM6_PAD3                     _UINT32_(2) 
#define PINMUX_PA10C_SERCOM6_PAD3                  ((PIN_PA10C_SERCOM6_PAD3 << 16) | MUX_PA10C_SERCOM6_PAD3)
#define PORT_PA10C_SERCOM6_PAD3                    (_UINT32_(1) << 10)

/* ========== PORT definition for SERCOM7 peripheral ========== */
#define PIN_PA12D_SERCOM7_PAD0                     _UINT32_(12)
#define MUX_PA12D_SERCOM7_PAD0                     _UINT32_(3) 
#define PINMUX_PA12D_SERCOM7_PAD0                  ((PIN_PA12D_SERCOM7_PAD0 << 16) | MUX_PA12D_SERCOM7_PAD0)
#define PORT_PA12D_SERCOM7_PAD0                    (_UINT32_(1) << 12)

#define PIN_PA01C_SERCOM7_PAD0                     _UINT32_(1) 
#define MUX_PA01C_SERCOM7_PAD0                     _UINT32_(2) 
#define PINMUX_PA01C_SERCOM7_PAD0                  ((PIN_PA01C_SERCOM7_PAD0 << 16) | MUX_PA01C_SERCOM7_PAD0)
#define PORT_PA01C_SERCOM7_PAD0                    (_UINT32_(1) << 1)

#define PIN_PA11D_SERCOM7_PAD1                     _UINT32_(11)
#define MUX_PA11D_SERCOM7_PAD1                     _UINT32_(3) 
#define PINMUX_PA11D_SERCOM7_PAD1                  ((PIN_PA11D_SERCOM7_PAD1 << 16) | MUX_PA11D_SERCOM7_PAD1)
#define PORT_PA11D_SERCOM7_PAD1                    (_UINT32_(1) << 11)

#define PIN_PA04C_SERCOM7_PAD1                     _UINT32_(4) 
#define MUX_PA04C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PA04C_SERCOM7_PAD1                  ((PIN_PA04C_SERCOM7_PAD1 << 16) | MUX_PA04C_SERCOM7_PAD1)
#define PORT_PA04C_SERCOM7_PAD1                    (_UINT32_(1) << 4)

#define PIN_PB00D_SERCOM7_PAD2                     _UINT32_(32)
#define MUX_PB00D_SERCOM7_PAD2                     _UINT32_(3) 
#define PINMUX_PB00D_SERCOM7_PAD2                  ((PIN_PB00D_SERCOM7_PAD2 << 16) | MUX_PB00D_SERCOM7_PAD2)
#define PORT_PB00D_SERCOM7_PAD2                    (_UINT32_(1) << 0)

#define PIN_PA05C_SERCOM7_PAD2                     _UINT32_(5) 
#define MUX_PA05C_SERCOM7_PAD2                     _UINT32_(2) 
#define PINMUX_PA05C_SERCOM7_PAD2                  ((PIN_PA05C_SERCOM7_PAD2 << 16) | MUX_PA05C_SERCOM7_PAD2)
#define PORT_PA05C_SERCOM7_PAD2                    (_UINT32_(1) << 5)

#define PIN_PB01D_SERCOM7_PAD3                     _UINT32_(33)
#define MUX_PB01D_SERCOM7_PAD3                     _UINT32_(3) 
#define PINMUX_PB01D_SERCOM7_PAD3                  ((PIN_PB01D_SERCOM7_PAD3 << 16) | MUX_PB01D_SERCOM7_PAD3)
#define PORT_PB01D_SERCOM7_PAD3                    (_UINT32_(1) << 1)

#define PIN_PA06C_SERCOM7_PAD3                     _UINT32_(6) 
#define MUX_PA06C_SERCOM7_PAD3                     _UINT32_(2) 
#define PINMUX_PA06C_SERCOM7_PAD3                  ((PIN_PA06C_SERCOM7_PAD3 << 16) | MUX_PA06C_SERCOM7_PAD3)
#define PORT_PA06C_SERCOM7_PAD3                    (_UINT32_(1) << 6)

