Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/include/pio/pic32ck1025sg01064.h
/* ========== PORT definition for TCC7 peripheral ========== */
#define PIN_PB07F_TCC7_WO0                         _UINT32_(39)
#define MUX_PB07F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PB07F_TCC7_WO0                      ((PIN_PB07F_TCC7_WO0 << 16) | MUX_PB07F_TCC7_WO0)
#define PORT_PB07F_TCC7_WO0                        (_UINT32_(1) << 7)

#define PIN_PC03F_TCC7_WO0                         _UINT32_(67)
#define MUX_PC03F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PC03F_TCC7_WO0                      ((PIN_PC03F_TCC7_WO0 << 16) | MUX_PC03F_TCC7_WO0)
#define PORT_PC03F_TCC7_WO0                        (_UINT32_(1) << 3)

#define PIN_PB08F_TCC7_WO1                         _UINT32_(40)
#define MUX_PB08F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PB08F_TCC7_WO1                      ((PIN_PB08F_TCC7_WO1 << 16) | MUX_PB08F_TCC7_WO1)
#define PORT_PB08F_TCC7_WO1                        (_UINT32_(1) << 8)

#define PIN_PC04F_TCC7_WO1                         _UINT32_(68)
#define MUX_PC04F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PC04F_TCC7_WO1                      ((PIN_PC04F_TCC7_WO1 << 16) | MUX_PC04F_TCC7_WO1)
#define PORT_PC04F_TCC7_WO1                        (_UINT32_(1) << 4)

/* ========== PORT definition for USB peripheral ========== */
#define PIN_PD03H_USB_DM                           _UINT32_(99)
#define MUX_PD03H_USB_DM                           _UINT32_(7) 
#define PINMUX_PD03H_USB_DM                        ((PIN_PD03H_USB_DM << 16) | MUX_PD03H_USB_DM)
#define PORT_PD03H_USB_DM                          (_UINT32_(1) << 3)

#define PIN_PD04H_USB_DP                           _UINT32_(100)
#define MUX_PD04H_USB_DP                           _UINT32_(7) 
#define PINMUX_PD04H_USB_DP                        ((PIN_PD04H_USB_DP << 16) | MUX_PD04H_USB_DP)
#define PORT_PD04H_USB_DP                          (_UINT32_(1) << 4)

#define PIN_PC01H_USB_SOF_1KHZ                     _UINT32_(65)
#define MUX_PC01H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PC01H_USB_SOF_1KHZ                  ((PIN_PC01H_USB_SOF_1KHZ << 16) | MUX_PC01H_USB_SOF_1KHZ)
#define PORT_PC01H_USB_SOF_1KHZ                    (_UINT32_(1) << 1)

#define PIN_PD02H_USB_SOF_1KHZ                     _UINT32_(98)
#define MUX_PD02H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PD02H_USB_SOF_1KHZ                  ((PIN_PD02H_USB_SOF_1KHZ << 16) | MUX_PD02H_USB_SOF_1KHZ)
#define PORT_PD02H_USB_SOF_1KHZ                    (_UINT32_(1) << 2)



#endif /* _PIC32CK1025SG01064_GPIO_H_ */

